<footer class="footer">
    <div class="footer-top">
        <div class="container">
            <div class="footer-col">
                <div class="footer__logo">
                    <a href="index.html">
                        <img src="/issets/img/logo-white.svg" alt="ALL-P Group" title="ALL-P Group">
                    </a>
                </div>
                <ul class="footer-social">
                    <li>
                        <a href="#" target="_blank">
                            <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M19.2036 16.3438L19.7145 13.0158H16.521V10.8561C16.521 9.9458 16.9669 9.05791 18.3973 9.05791H19.849V6.2247C19.849 6.2247 18.5318 6 17.2721 6C14.6423 6 12.9234 7.59418 12.9234 10.4797V13.0164H10V16.3444H12.9234V24.39H16.521V16.3444L19.2036 16.3438Z" fill="currentColor"/>
                            </svg>
                        </a>
                    </li>
                    <li>
                        <a href="#" target="_blank">
                            <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M24.3332 11.4376C24.3219 10.6645 24.1789 9.89745 23.9052 9.17434C23.4262 7.93954 22.4508 6.96313 21.216 6.48514C20.5021 6.21653 19.7473 6.07252 18.9833 6.05617C18.0008 6.01226 17.6893 6 15.1952 6C12.701 6 12.3814 6 11.406 6.05617C10.643 6.07252 9.88826 6.21653 9.17434 6.48514C7.93953 6.96313 6.96313 7.93954 6.48514 9.17434C6.21653 9.88826 6.07149 10.643 6.0572 11.406C6.01328 12.3895 6 12.701 6 15.1952C6 17.6893 6 18.008 6.0572 18.9844C6.07252 19.7483 6.21653 20.5021 6.48514 21.218C6.96415 22.4518 7.93953 23.4282 9.17536 23.9062C9.88622 24.184 10.641 24.3413 11.407 24.3658C12.3906 24.4097 12.7021 24.423 15.1962 24.423C17.6903 24.423 18.01 24.423 18.9854 24.3658C19.7483 24.3505 20.5031 24.2065 21.218 23.9379C22.4529 23.4589 23.4282 22.4825 23.9072 21.2487C24.1759 20.5337 24.3199 19.78 24.3352 19.015C24.3791 18.0325 24.3924 17.721 24.3924 15.2258C24.3903 12.7317 24.3903 12.4151 24.3332 11.4376ZM15.189 19.9117C12.5805 19.9117 10.4674 17.7986 10.4674 15.1901C10.4674 12.5815 12.5805 10.4684 15.189 10.4684C17.7955 10.4684 19.9107 12.5815 19.9107 15.1901C19.9107 17.7986 17.7955 19.9117 15.189 19.9117ZM20.0987 11.3947C19.4889 11.3947 18.9976 10.9025 18.9976 10.2937C18.9976 9.68501 19.4889 9.19273 20.0987 9.19273C20.7064 9.19273 21.1986 9.68501 21.1986 10.2937C21.1986 10.9025 20.7064 11.3947 20.0987 11.3947Z" fill="currentColor"/>
                                <path d="M15.1882 18.2592C16.8821 18.2592 18.2553 16.886 18.2553 15.1921C18.2553 13.4982 16.8821 12.125 15.1882 12.125C13.4943 12.125 12.1211 13.4982 12.1211 15.1921C12.1211 16.886 13.4943 18.2592 15.1882 18.2592Z" fill="currentColor"/>
                            </svg>
                        </a>
                    </li>
                    <li>
                        <a href="#" target="_blank">
                            <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.2764 23.3439L12.6182 18.1807L21.9926 9.73395C22.4076 9.35555 21.9071 9.17246 21.3578 9.50203L9.78633 16.8136L4.78177 15.2268C3.70763 14.9216 3.69542 14.177 5.0259 13.6399L24.5193 6.1209C25.4103 5.7181 26.2647 6.34061 25.923 7.70771L22.6029 23.3439C22.371 24.4547 21.6996 24.7232 20.7719 24.2105L15.7186 20.4754L13.2895 22.8312C13.0088 23.112 12.7769 23.3439 12.2764 23.3439Z" fill="currentColor"/>
                            </svg>
                        </a>
                    </li>
                    <li>
                        <a href="#" target="_blank">
                            <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M20.25 6H9.75C7.67925 6 6 7.67925 6 9.75V20.25C6 22.3207 7.67925 24 9.75 24H20.25C22.3215 24 24 22.3207 24 20.25V9.75C24 7.67925 22.3215 6 20.25 6ZM12 20.25H9.75V12H12V20.25ZM10.875 11.049C10.1505 11.049 9.5625 10.4565 9.5625 9.726C9.5625 8.9955 10.1505 8.403 10.875 8.403C11.5995 8.403 12.1875 8.9955 12.1875 9.726C12.1875 10.4565 11.6003 11.049 10.875 11.049ZM21 20.25H18.75V16.047C18.75 13.521 15.75 13.7122 15.75 16.047V20.25H13.5V12H15.75V13.3238C16.797 11.3843 21 11.241 21 15.1807V20.25Z" fill="currentColor"/>
                            </svg>
                        </a>
                    </li>
                </ul>
            </div>
            <div class="footer-col">
                <div class="footer-item">
                    <div class="footer-item__title">
                        {{__('asd.График работы:')}}
                    </div>
                    <div class="footer-item__text">
                        {{__('asd.09:00 - 18:00 ПН-ПТ')}}
                    </div>
                </div>
                <div class="footer-item">
                    <div class="footer-item__title">
                        {{__('asd.Телефон')}}
                    </div>
                    <div class="footer-item__text">
                        <a href="tel:+998996354444">+998 (99) 635-44-44</a>
                    </div>
                </div>
            </div>
            <div class="footer-col">
                <div class="footer-item">
                    <div class="footer-item__title">
                        {{__('asd.Адрес')}}
                    </div>
                    <div class="footer-item__text">
                        {{__('asd.700077 г. Ташкент, Мирзо-Улугбекский район, проспект Мустакиллик 67')}}
                    </div>
                </div>
                <div class="footer-item">
                    <div class="footer-item__title">
                        {{__('asd.E-mail')}}
                    </div>
                    <div class="footer-item__text">
                        <a href="mailto:office@all-p.uz">office@all-p.uz</a>
                    </div>
                </div>
            </div>
            <div class="footer-col">
				<a href="#" class="footer-arrow">
					<svg width="28" height="9" viewBox="0 0 28 9" fill="none" xmlns="http://www.w3.org/2000/svg">
						<path d="M14 1.22392e-06L7.86805e-07 9L13.9998 5.75L28 9L14 1.22392e-06Z" fill="currentColor"/>
					</svg>
					<span>{{__('asd.Наверх')}}</span>
				</a>
			</div>
        </div>
    </div>
    <div class="footer-bot">
        <div class="container">
            <p>© 2023 All-P.{{__('asd. Все права защищены.')}}</p>
            <a href="https://www.novastudio.uz/" target="_blank">Design by NovaS</a>
        </div>
    </div>
</footer>